import os
import csv
import requests
from pprint import pprint
import datetime
from datetime import timedelta
import csv
from pprint import pprint

# with open('test2.csv', newline='') as csvfile:
#     reader = csv.DictReader(csvfile)
#     for row in reader:
#         print(row['movie_code'])


# date = datetime.datetime.now()
# ago7 = timedelta(days=-7)
# print((date+ago7).strftime('%Y%m%d'))
# print(date)
# url = f"http://www.kobis.or.kr/kobisopenapi/webservice/rest/boxoffice/searchDailyBoxOfficeList.json?key=430156241533f1d058c603178cc3ca0e&targetDt=20190113&weekGb=\"0\""  # token전환 할 것
# req = requests.get(url).json()

# pprint(req['boxOfficeResult']['dailyBoxOfficeList'][0])

pp = {'20000067': {'영화명': '러브레터', '해당일': '20171216', '해당일관객수': '4160'},
 '20040695': {'영화명': '이프 온리', '해당일': '20171209', '해당일관객수': '10013'},
 '20150976': {'영화명': '신과함께-죄와 벌', '해당일': '20180113', '해당일관객수': '310297'},
 '20161681': {'영화명': '미옥', '해당일': '20171111', '해당일관객수': '55584'},
 '20161762': {'영화명': '반드시 잡는다', '해당일': '20171209', '해당일관객수': '17306'},
 '20161872': {'영화명': '너의 이름은.', '해당일': '20180106', '해당일관객수': '6225'},
 '20165748': {'영화명': '꾼', '해당일': '20171216', '해당일관객수': '30267'},
 '20167904': {'영화명': '라라랜드', '해당일': '20171209', '해당일관객수': '13968'},
 '20168221': {'영화명': '저스티스 리그', '해당일': '20171202', '해당일관객수': '23699'},
 '20168754': {'영화명': '7호실', '해당일': '20171125', '해당일관객수': '6414'},
 '20169643': {'영화명': '침묵', '해당일': '20171111', '해당일관객수': '25071'},
 '20170402': {'영화명': '강철비', '해당일': '20180113', '해당일관객수': '12962'},
 '20170443': {'영화명': '스타워즈: 라스트 제다이', '해당일': '20171230', '해당일관객수': '3472'},
 '20170590': {'영화명': '1987', '해당일': '20180113', '해당일관객수': '434056'},
 '20171024': {'영화명': '너의 췌장을 먹고 싶어', '해당일': '20171118', '해당일관객수': '5718'},
 '20171909': {'영화명': '쥬만지: 새로운 세계', '해당일': '20180113', '해당일관객수': '133379'},
 '20172603': {'영화명': '부라더', '해당일': '20171118', '해당일관객수': '28393'},
 '20172742': {'영화명': '범죄도시', '해당일': '20171125', '해당일관객수': '9109'},
 '20173547': {'영화명': '다운사이징', '해당일': '20180113', '해당일관객수': '37639'},
 '20173581': {'영화명': '기억의 밤', '해당일': '20171216', '해당일관객수': '32385'},
 '20173693': {'영화명': '어쌔신: 더 비기닝', '해당일': '20171209', '해당일관객수': '46759'},
 '20174222': {'영화명': '키드냅', '해당일': '20171125', '해당일관객수': '4893'},
 '20174585': {'영화명': '메리와 마녀의 꽃', '해당일': '20171223', '해당일관객수': '3809'},
 '20174622': {'영화명': '해피 데스데이', '해당일': '20171202', '해당일관객수': '8718'},
 '20174846': {'영화명': '뽀로로 극장판 공룡섬 대모험', '해당일': '20180106', '해당일관객수': '3725'},
 '20174965': {'영화명': '극장판 포켓몬스터 너로 정했다!', '해당일': '20180106', '해당일관객수': '7139'},
 '20175121': {'영화명': '토르: 라그나로크', '해당일': '20171202', '해당일관객수': '13158'},
 '20175223': {'영화명': '래빗 스쿨', '해당일': '20171202', '해당일관객수': '6064'},
 '20175244': {'영화명': '극장판 파워레인저: 애니멀포스 VS 닌자포스 미래에서 온 메시지 ',
              '해당일': '20171118',
              '해당일관객수': '7338'},
 '20175288': {'영화명': '피터와 모글리의 크리스마스 어드벤처',
              '해당일': '20171125',
              '해당일관객수': '8244'},
 '20175441': {'영화명': '채비', '해당일': '20171118', '해당일관객수': '6519'},
 '20175481': {'영화명': '튤립 피버', '해당일': '20171216', '해당일관객수': '8328'},
 '20176022': {'영화명': '더 크리스마스', '해당일': '20171223', '해당일관객수': '9129'},
 '20176082': {'영화명': '몬스터 패밀리', '해당일': '20171230', '해당일관객수': '25664'},
 '20176367': {'영화명': '극장판 숲의 요정 페어리루 ~크리스마스의 기적: 마법의 날개~',
              '해당일': '20171216',
              '해당일관객수': '16595'},
 '20176947': {'영화명': '원더', '해당일': '20180113', '해당일관객수': '6175'},
 '20177104': {'영화명': '페르디난드', '해당일': '20180113', '해당일관객수': '21373'},
 '20177479': {'영화명': '극장판 프리파라 모두의 동경♪ 렛츠고☆프리파리',
              '해당일': '20171230',
              '해당일관객수': '8359'},
 '20177602': {'영화명': '쏘아올린 불꽃, 밑에서 볼까? 옆에서 볼까?',
              '해당일': '20180113',
              '해당일관객수': '4734'},
 '20178581': {'영화명': '오리엔트 특급 살인', '해당일': '20171216', '해당일관객수': '5747'},
 '20179462': {'영화명': '위대한 쇼맨', '해당일': '20180113', '해당일관객수': '24602'},
 '20179942': {'영화명': '러빙 빈센트', '해당일': '20171223', '해당일관객수': '2939'},
 '20179985': {'영화명': '코코', '해당일': '20180113', '해당일관객수': '306184'}}
# uurl = "http://www.kobis.or.kr/kobisopenapi/webservice/rest/movie/searchMovieInfo.json?key=fd184a239b9653fe6b1c0c91c95f6184&movieCd=20124079"
# req = requests.get(uurl).json()['movieInfoResult']['movieInfo']['actors']

# pprint(req)

# url = "https://finance.naver.com/sise/"
# req = requests.get(url).text

# soup = BeautifulSoup(req,'html.parser')
# kospi = soup.select_one('#KOSPI_now').text
# print(kospi)


# with open('movie.csv', newline='', encoding = 'utf-8') as csvfile:
#         reader = csv.DictReader(csvfile)
#         func2_list = []
#         for row in reader:
#             print(row['영화코드'])

n_key = os.getenv("NAVER_KEY")
n_secret = os.getenv("NAVER_SECRET")

url = "https://openapi.naver.com/v1/search/movie.json?query=내안의 그놈&display=100&start=1"
headers = {
    "X-Naver-Client-Id": n_key,
    "X-Naver-Client-Secret": n_secret
}
req = requests.get(url, headers = headers).json()


pprint(req)